app/controllers/api/couriers_controller.rb

  def index
  @courier = Courier.find_by(params[:id])
---
SELECT  "couriers".* FROM "couriers" WHERE (1) LIMIT $1  [["LIMIT", 1]]

  def get_courier(id)
    @courier = Courier.find_by(id:id)
---
SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]