app/controllers/api/packages_controller.rb

SELECT  "packages".* FROM "packages" WHERE "packages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_package(id)
    @package = Package.find_by(id:id)